VPro/src/Catalogs/VehiclesLicenseCards/VehiclesLicenseCards.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>VehiclesLicenseCards</name>
  <owners>Catalog.Vehicles</owners>
  <attributes>
    <name>LicenseCardSeries</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LicenseCardNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LicenseCardKind</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LicenseCardsDateIssued</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VehicleLicenseValidityPeriod</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ActivityKind</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>LicenseOwner</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationNumberInGovernmentAgency</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

VPro/src/Catalogs/VehiclesLicenseCards/Forms/ItemForm/Module.bsl
#Region ServiceProceduresAndFunctions

&AtClient
Procedure GenerateDescription()
	
	Object.Description = NStr("en='Series ';ru='серия ';vi='sê-ri'") + Object.LicenseCardSeries + NStr("en=' # ';ru=' # ';vi=' # '") + Object.LicenseCardNumber + NStr("en=' dated ';ru=' от ';vi='ngày'") + Format(Object.LicenseCardsDateIssued, "DF=dd.MM.yyyy");
	
	If ValueIsFilled(Object.LicenseOwner) Then
		
		Object.Description = Object.Description + NStr("en='. Owner: ';ru='. Владелец: ';vi='. Chủ sở hữu:'") + Object.LicenseOwner;
		
	EndIf;
	
EndProcedure

#EndRegion

#Region FormEventsHandlers

#EndRegion

#Region FormItemEventsHandlers

&AtClient
Procedure LicenseCardSeriesOnChange(Item)
	
	GenerateDescription();
	
EndProcedure

&AtClient
Procedure LicenseCardNumberOnChange(Item)
	
	GenerateDescription();
	
EndProcedure

&AtClient
Procedure LicenseCardsDateIssuedOnChange(Item)
	
	GenerateDescription();
	
EndProcedure

&AtClient
Procedure LicenseOwnerOnChange(Item)
	
	GenerateDescription();
	
EndProcedure

#EndRegion
